Tekla.Structures.Model.GridSurface
The GridSurface class defines a user defined (possibly magnetic) surface helping in modeling work. A grid surface must
always belong to a parent GridBase instance.

Tekla.Structures.Model.GridSurface.Parent
The parent grid of the grid surface.

Tekla.Structures.Model.GridSurface.Label
The label for the grid surface.

Tekla.Structures.Model.GridSurface.IsMagnetic
Whether the grid surface is magnetic or not.

Tekla.Structures.Model.GridSurface.ExtensionLeft
The line extension on the left.

Tekla.Structures.Model.GridSurface.ExtensionRight
The line extension on the right.

Tekla.Structures.Model.GridSurface.ExtensionBelow
The line extension below.

Tekla.Structures.Model.GridSurface.ExtensionAbove
The line extension above.

Tekla.Structures.Model.GridSurface.DrawingVisibility
The visibility of the grid surface in drawings.

Tekla.Structures.Model.GridSurface.IsManual
Gets or sets if the line was manually created.

Tekla.Structures.Model.GridSurface.#ctor
Creates a new grid surface instance.
The default values are as follows:
Label = "Default";
IsMagnetic = false;
ExtensionLeft  = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;

Tekla.Structures.Model.GridSurface.#ctor(System.String)
Creates a new grid surface instance taking the label as input.
label: The label for the grid surface.

Tekla.Structures.Model.GridSurface.Insert
Inserts the grid surface into the model.
Returns: True on success.

Tekla.Structures.Model.GridSurface.Select
Selects the grid surface with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridSurface.Modify
Modifies the grid surface with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridSurface.Delete
Deletes the grid surface with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridSurface.CreateInstance
Inserts the grid surface into the model.
Returns: True on success.

Tekla.Structures.Model.GridSurface.SelectInstance
Selects the grid surface with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridSurface.ModifyInstance
Modifies the grid surface with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridSurface.ToStruct(Tekla.Structures.ModelInternal.dotGridPlane_t@)
Fills the struct to transport information to Core.
Remarks:
Must be overridden to fill the missing information
dotPlane: Struct to be filled

Tekla.Structures.Model.GridSurface.FromStruct(Tekla.Structures.ModelInternal.dotGridPlane_t@)
Sets the current instance from a struct transported from Core.
Remarks:
Must be overridden to fill the missing information
dotPlane: Struct get the data from